a = [0,1,1,2,0,0,0,0,5,5,6,2,0,0]
for i in range(len(a)-1,-1,-1): #начало с нулевого индекса , -1 = последний элемент, -1 = шаг обратный
    if a[i] == 0:
        del(a[i]) #удаляем ноль
        a.append(0) # добавляем ноль в конец массива
print(a)

# nums = [0,1,1,2,0,0,0,0,5,5,6,2,0,0]
# j = 0 #счетчик для остановки цикла
# i = len(nums)-1
# while j < i:
#     if nums[j] == 0:
#         del(nums[j])
#         nums.append(0)
#         i -= 1
#     else:
#         j += 1
#
# print(nums)
